Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/houses_of_the_oireachtas/privileges_of_tds_and_senators.html.txt.tmx
Source language: en
Languages: ga

source: Members of the Oireachtas (TDs and Senators) enjoy certain constitutional privileges
ga: Tá pribhléidí áirithe bunreachtúla ag an Oireachtas (Teachtaí Dála agus Seanadóirí) in Éirinn

source: This means that they have certain rights and privileges that are set down by Bunreacht na hÉireann (the Irish Constitution)
ga: Ciallaíonn seo go bhfuil cearta agus pribhléidí áirithe acu atá leagtha síos ag Bunreacht na hÉireann

source: • TDs and Senators may not, for example, be arrested when going to, returning from or being within the precincts of either the Dáil or Seanad
ga: • Ní ceadmhach, mar shampla, Teachtaí Dála ná Seanadóirí a ghabháil le linn dóibh a bheith ag dul chuig aon cheann den Dáil nó an Seanad) ag filleadh uathu nó le linn dóibh a bheith laistigh de phurláin ceachtar den dá Theach

source: This privilege does not apply to arrest for treason, felony or breach of the peace
ga: Níl feidhm leis an bpribhléid sin i gcás gabhála de bharr tréasa, feileonachta ná briseadh síochána

source: • TDs and Senators may not be sued for defamation because of any speech in the House
ga: • Ní féidir dlí a agairt ar Theachtaí Dála ná ar Sheanadóirí de bharr aon óráide sa Teach

source: This privilege protects members both in the House and at Committee hearings
ga: Tugann an phribhléid seo cosaint do bhaill sa Teach agus ag éisteachtaí Coistí araon

source: If a member of either House acts in a way that amounts to an abuse of a privilege, the Committee on Procedures and Privileges may recommend disciplining the member
ga: Má ghníomhaíonn ball cheachtar den dá Theach ar bhealach arb ionann é agus mí-úsáid pribhléide, is féidir leis An Coiste um Nós Imeachta agus Pribhléidí moladh a dhéanamh an ball a chur faoi smach
